app/controllers/stores_controller.rb

INSERT INTO "stores" ("name", "in_stock", "supplier", "delivery_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Apple"], ["in_stock", "t"], ["supplier", "Kroger"], ["delivery_date", "2015-03-23"], ["created_at", "2015-03-23 15:15:05.560533"], ["updated_at", "2015-03-23 15:15:05.560533"]]
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

UPDATE "stores" SET "in_stock" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["in_stock", "t"], ["updated_at", "2015-03-23 16:13:57.696353"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @store.update(store_params)

DELETE FROM "stores" WHERE "stores"."id" = ?  [["id", 1]]
---
  def destroy
    @store.destroy